{
    "app-name": "Salwort Devs",
    "page": {
        "home": "Inicio",
        "devs": "Desarrolladores",
        "apps": "Aplicaciones",
        "about": "Acerca de"
    },
    "policy_privaticy": {
        "title": "Politicas de privacidad",
        "description": "En Salwort Devs, nos comprometemos a proteger y respetar su privacidad. Esta política de privacidad explica cómo recopilamos, usamos, divulgamos y protegemos su información personal cuando visita nuestro sitio web y utiliza nuestros servicios.",
        "title-point-1": "Información que recopilamos",
        "description-point-1": "Podemos recopilar y procesar los siguientes datos personales: Información que usted nos proporciona: Nombre, dirección de correo electrónico, número de teléfono y cualquier otra información que nos envíe a través de formularios en nuestro sitio web. Información que recopilamos automáticamente: Información sobre su visita, incluidos los datos de tráfico, los datos de ubicación, los weblogs y otros datos de comunicación, así como los recursos a los que accede. Cookies y tecnologías similares: Utilizamos cookies para recopilar información sobre su actividad en línea en nuestro sitio web. Puede controlar el uso de cookies a través de la configuración de su navegador.",
        "title-point-2": "Uso de su información",
        "description-point-2": "Utilizamos la información que recopilamos para los siguientes fines:\n\nProporcionar y gestionar nuestros servicios.\nPersonalizar su experiencia en nuestro sitio web.\n\nComunicarnos con usted, incluyendo el envío de notificaciones y actualizaciones importantes.\n\nMejorar nuestro sitio web y servicios mediante el análisis de cómo los usuarios interactúan con ellos.\nCumplir con nuestras obligaciones legales y resolver disputas.",
        "title-point-3": "Divulgación de su información",
        "description-point-3": "Podemos compartir su información personal con terceros en las siguientes circunstancias:\n\nCon proveedores de servicios que nos ayudan a operar nuestro negocio, como servicios de alojamiento web y análisis de datos.\n\nSi estamos obligados a divulgar su información para cumplir con una obligación legal o para proteger nuestros derechos, propiedad o seguridad.\n\nEn caso de una fusión, adquisición o venta de activos, sus datos pueden ser transferidos como parte de la transacción.",
        "title-point-4": "Seguridad de su información",
        "description-point-4": "Tomamos medidas razonables para proteger su información personal contra el acceso no autorizado, la alteración, la divulgación o la destrucción.\n\nSin embargo, ninguna transmisión de datos a través de Internet o almacenamiento electrónico es completamente segura.\n\nPor lo tanto, no podemos garantizar la seguridad absoluta de su información.",
        "title-point-5": "Retencion de información",
        "description-point-5": "Retenemos su información personal solo durante el tiempo necesario para cumplir con los fines para los que fue recopilada, incluidos los requisitos legales, contables o de informes.",
        "title-point-6": "Sus derechos",
        "description-point-6": "Tiene derecho a acceder, corregir, actualizar o eliminar su información personal. También puede tener derecho a restringir o oponerse al procesamiento de su información personal, así como a solicitar la portabilidad de sus datos. Para ejercer estos derechos, comuníquese con nosotros a través de los detalles de contacto proporcionados a continuación.",
        "title-point-7": "Cambios a esta política de privacidad",
        "description-point-7": "Podemos actualizar esta política de privacidad de vez en cuando. Publicaremos cualquier cambio en esta página y, si los cambios son significativos, le notificaremos por correo electrónico o mediante un aviso en nuestro sitio web."
    },
    "home": {
        "home-description": "En Salwort somos una empresa joven e innovadora. Comprometidos con la investigación, optimización y sistematizar soluciones.",
        "title-1": "Pantalla Principal",
        "screen-1": " En esta pantalla tu puedes registrarte en caso de tu tener una cuenta ya, crear una o ingresar con Google ",
        "title-2": "Pagina de inicio",
        "screen-2": "Podras observar varias secciones, los tabaleros que tienes, sus estados y abajo un top de categorias, para que puedas ver las categorias que mas has usado",
        "title-3": "Tableros",
        "screen-3": "Aqui puedes agregar un  tablero junto con su detalle",
        "title-4": "Tablero guardado",
        "screen-4": "Aqui ya puedes apreciar como se guardó el tablero",
        "title-5": "Categorias",
        "screen-5": " En esta pantalla puedes agregar tus categorias",
        "title-6": " Como agregar categorias",
        "screen-6": "Basta con darle al boton de mas para poder agregar una categoria, posteriormente solo debes pulsar la confirmación",
        "title-7": "Estados",
        "screen-7": "Puedes visualizar un listado de tus estados, asi como un ejemplo de como se ven.",
        "title-8": "Como agregar estados",
        "screen-8": "Es tan simple como pulsar el boton de agregar, colocarle un nombre a tu estado asi como sus colores, y luego confirmar",
        "title-9": "Perfil de usuario",
        "screen-9": "Tus datos de usuario, puedes actualizar tu nombre correo y contraseña"
    },
    "apps-features": {
        "properties": {
            "name-1-activityp": "Administra tu tiempo",
            "detail-1-activityp": "Podras administrar mejor tu tiempo, no se te olvidar cosas",
            "name-2-activityp": "Planifica tus actividades",
            "detail-2-activityp": "El planificar tus actividades aprovecha tu tiempo al maximo",
            "name-3-activityp": "Aprovecha tu tiempo",
            "detail-3-activityp": "Aprovechar tu tiempo te servira para poder tener bien medido tus tiempos",
            "name-1-cooking": "Muchos tipos de comida ",
            "detail-1-cooking": "En esta aplicacion vas a poder descubrir una cantidad inimaginable de recetas que te encantaran",
            "name-2-cooking": "Socializa mediante recetas",
            "detail-2-cooking": "Vas a poder dejar retroalimentacion a las recetas, de esa manera haciendole saber a todos la calidad de la receta"
        }
    },
    "footer": {
        "description": "Bienvenido a Saltwort Devs. Nos comprometemos a proteger y respetar su privacidad. Los datos proporcionados por los usuarios o contactos son altamente resguardados por nuestras politicas de privacidad rigorosas. Para conocer nuestras politicas de privacidad,",
        "contact-us": "Contactanos"
    },
    "about-of": {
        "mision": " Misión",
        "vision": " Visión",
        "objectives": " Objectivos",
        "mision-desc": " Nuestro compromiso es desarrollar propuestas que impulsen el crecimiento y la eficiencia de nuestros clientes, proporcionando soluciones adaptadas a un entorno en constante evolución, con el objetivo de construir un futuro más sostenible y competitivo.",
        "vision-desc": "  Ser reconocidos como líderes en innovación y desarrollo de soluciones tecnológicas que transformen la forma en que las empresas operan y se adaptan a un mundo en constante cambio. Aspiramos a establecer nuevos estándares de eficiencia y sostenibilidad en cada sector en el que participamos, convirtiéndonos en el socio preferido para organizaciones que buscan no solo crecer, sino también evolucionar con agilidad y resiliencia. En Saltwort, visualizamos un futuro donde nuestras soluciones no solo resuelven problemas actuales, sino que también anticipan las necesidades futuras, creando un impacto duradero y positivo en la sociedad y el medio ambiente.",
        "objectives-desc": " En Saltwort nos enfocamos en desarrollar tecnologías innovadoras que optimicen la eficiencia operativa de nuestros clientes, permitiéndoles adaptarse con agilidad a los cambios del mercado. Nos comprometemos a la investigación continua, la creación de soluciones sostenibles y la expansión estratégica en mercados globales, mientras priorizamos la satisfacción del cliente mediante la entrega de soluciones personalizadas y de alta calidad."
    },
    "Devs": {
        "Luis-desc": "Soy un desarrollador junior con experiencia en varias tecnologías, incluyendo el uso de Android Studio con Kotlin y Visual Studio con C#. Tengo habilidades en la gestión de bases de datos, trabajando con PostgreSQL, MySQL y Management. Me considero una persona con gran disposición para aprender y crecer en el campo del desarrollo",
        "Samuel-desc": "Con más de 5 años de experiencia en diversas áreas, cuento con sólidos conocimientos en el desarrollo de aplicaciones Android usando Java, Kotlin y XML. En el ámbito web, manejo tecnologías como JavaScript, HTML, CSS, Angular y TypeScript para crear soluciones interactivas y eficientes. Además, tengo experiencia en el backend con Node.js, PHP y NestJS, y en la gestión de servicios AWS, incluyendo EC2, S3 y otros",
        "Aksel-desc": "Con experiencia en el desarrollo nativo para iOS utilizando Swift y en la creación de aplicaciones web con Angular, también cuento con habilidades en la elaboración de APIs REST con NestJS en entornos Node.js. Mi experiencia abarca la integración de servicios externos, la migración de tecnologías y la optimización de sistemas para mejorar el rendimiento y la escalabilidad"
    },
    "Devs-big-desc": {
        "properties": {
            "Luis-desc": "Soy un desarrollador junior con experiencia en diversas tecnologías, destacando mi habilidad en Android Studio con Kotlin para el desarrollo de aplicaciones móviles, donde he creado interfaces de usuario intuitivas e integrado características avanzadas. También tengo experiencia en Visual Studio con C#, desarrollando aplicaciones de escritorio y servicios eficientes. Mi competencia se extiende a la gestión de bases de datos, con conocimientos en PostgreSQL, MySQL y herramientas de administración. Me considero una persona altamente motivada y dispuesta a aprender, con un enfoque constante en mejorar mis habilidades y crecer en el campo del desarrollo",
            "Samuel-desc": "Desarrollador con más de 5 años de experiencia en desarrollo web y backend, y experto en Android Studio con Java y Kotlin. En el desarrollo móvil, he utilizado Android Studio para crear aplicaciones robustas, optimizando el rendimiento y la experiencia del usuario con Java y Kotlin. Tengo experiencia en el diseño de interfaces con XML, la integración de APIs, y la implementación de arquitecturas como MVVM. En el ámbito web, soy competente en tecnologías frontend como JavaScript, HTML, CSS y Angular, con un enfoque en la creación de interfaces responsivas. En el backend, tengo amplios conocimientos en Node.js, PHP y NestJS, con experiencia en la generación de archivos XLSX y CSV. Además, manejo servicios en la nube de AWS, incluyendo EC2, S3 y ELB, con experiencia en el despliegue de aplicaciones en subdominios de EC2 y la administración de contenedores S3. He utilizado PM2 para despliegues en AWS y he implementado validaciones de compras a través de APIs de Google en proyectos backend. Mi experiencia también incluye el uso de Bootstrap para diseño CSS y el despliegue de aplicaciones en entornos de producción de alta disponibilidad",
            "Aksel-desc": "Soy un programador con amplia experiencia en el desarrollo de aplicaciones móviles para iOS utilizando Swift, creando soluciones eficientes y bien diseñadas para la plataforma Apple. En el desarrollo web, manejo con soltura Angular para construir interfaces de usuario dinámicas y responsivas que se adaptan a diferentes dispositivos. Tengo un sólido conocimiento en la creación de APIs REST con NestJS en entornos Node.js, facilitando una comunicación segura y eficiente entre sistemas. Mi experiencia incluye la integración de servicios externos, la migración de tecnologías para asegurar transiciones suaves y sin interrupciones, y la optimización de sistemas para mejorar el rendimiento y la escalabilidad, adaptándome a las crecientes demandas del mercado",
            "related-projects": "Proyectos relacionados"
        }
    },
    "specific-project": {
        "properties": {
            "project-detail-ventaplus-luis": "Punto de venta",
            "revelant-skills-1-ventaplus-luis": "Actualizacion de versiones",
            "revelant-skills-2-ventaplus-luis": "Cambio de la version 24 a la version 33",
            "project-detail-crm-luis": "CRM para clientes ",
            "revelant-skills-1-crm-luis": "Consultas base de datos",
            "revelant-skills-2-crm-luis": "Creacion PDF y exportacion Excel",
            "revelant-skills-3-crm-luis": "Arquitectura MVC",
            "project-detail-cvm-luis": "Proyecto interno",
            "revelant-skills-cvm-1-luis": "Inyección de dependencias",
            "revelant-skills-cvm-2-luis": "Retrofit",
            "revelant-skills-cvm-3-luis": "Arquitectura MVVM",
            "project-detail-encode-aksel": "Aplicación web estática desarrollada en Angular que centraliza los manuales de usuario de las aplicaciones internas de la empresa, junto con los términos y condiciones y las políticas de privacidad. Su objetivo es facilitar el acceso a la documentación oficial de forma clara y organizada.",
            "revelant-skills-encode-aksel": "Cambio de cocoa pods",
            "desc-general": "Dentro de este proyecto implemente el puesto como desarrollador android, de las funciones relevantes dentro de esta aplicacion son: ",
            "project-detail-shopping-expense-samuel": "Proyecto de funcionalidad o herramienta diseñada para registrar, de manera sistemática y organizada, toda la información relevante sobre la entrada de datos en un proyecto. Permite gestionar y almacenar detalles específicos de cada ingreso, asegurando precisión y trazabilidad. Este sistema facilita la administración y el seguimiento de los datos ingresados, optimizando el flujo de trabajo y brindando soporte en la toma de decisiones al permitir una visión clara y actualizada del progreso en el proyecto.",
            "revelant-skills-shopping-expenses-samuel": "Creacion de proyecto",
            "project-detail-daily-expenses-samuel": "Capturador de ingreso en proyecto",
            "revelant-skills-daily-expenses-samuel": "Creacion de proyecto",
            "project-name-zeus": "ZEUS",
            "project-detail-zeus": "Implementación eficiente del seguimiento y resolución de tickets de soporte, integrando automatización para la actualización y control automático del estado de los folios, optimizando tiempos de respuesta y mejorando la trazabilidad de las incidencias.",
            "project-name-sisap": "SISAP",
            "project-detail-sisap": "Applicación para brindar movilidad a los usuarios internos de Telcel en el seguimiento de folios SISAP los proyectos en donde se este involucrado.",
            "project-detail-blue-board": "Telcel busca poder agilizar la gestión de noticias (promociones), por ello se creó la aplicación “BLUE BOARD”, esta aplicación se encarga de visualizar noticias. Estas noticias llegan en tiempo real por medio de una aplicación móvil, a todos los clientes (administradores regionales, distribuidores, gerentes y vendedores) no importando en cuál de las 8 regiones se encuentren, estarán informados de las diferentes noticias y promociones que Telcel lance a nivel nacional.",
            "project-name-gamstore": "GAMSTORE",
            "project-detail-gamstore": "PENDIENTE",
            "project-detail-price-list": "Aplicacion movil que le muestra a los usuarios una lista de precios de todos sus productos, pudiendo filtrar porque precios mostrar y por un buscador de productos."
        }
    },
    "project-relevance": {
        "encodemx-web": {
            "interface-creation-title": "Creación de la interfaz.",
            "interface-creation": "Se diseñó y construyó completamente la interfaz del sitio, asegurando una estructura clara, estética coherente y navegación intuitiva.",
            "translate-web-title": "Manejo de traducciones.",
            "translate-web": "Se implementó un sistema de internacionalización que permite visualizar el contenido en tres idiomas distintos, ampliando el alcance del portal a usuarios con diferentes lenguas.",
            "responsive-desing-title": "Diseño responsivo.",
            "responsive-desing": "Se adaptó la interfaz para ofrecer una experiencia óptima en dispositivos móviles, garantizando la funcionalidad y legibilidad en pantallas pequeñas.",
            "better-response-title": "Mejorar tiempos de carga.",
            "better-response": "Se optimizó el rendimiento del sitio mediante la conversión de imágenes pesadas a formato .webp, reduciendo significativamente los tiempos de carga.",
            "skeletons-loaders-title": "Agregar skeletons de carga.",
            "skeletons-loaders": "Se integraron skeletons como indicadores visuales durante la carga de contenido, mejorando la percepción de velocidad del sitio."
        },
        "shopping-expense-ios": {
            "migration-request-title": "Migración de requests en la versión móvil iOS.",
            "migration-request": "Se adaptaron y migraron las peticiones de red en la versión móvil iOS para asegurar compatibilidad y estabilidad con el nuevo backend.",
            "backup-system-title": "Sistema de respaldos en formato JSON.",
            "backend-system": "Se creó un sistema de respaldos automáticos en formato JSON, permitiendo la recuperación de datos en caso de fallos.",
            "support-app-title": "Soporte a errores reportados por los usuarios.",
            "support-app": "Se atendieron y resolvieron errores funcionales identificados por los usuarios, contribuyendo a una experiencia de uso más estable.",
            "better-time-title": "Mejora en ciertos tiempos de carga.",
            "better-time": "Se optimizaron procesos clave en el backend y en la app móvil para reducir los tiempos de respuesta y carga.",
            "dependetion-system-title": "Migración de dependencias de CocoaPods a Swift Package Manager.",
            "dependetion-system": "Se migraron las dependencias del proyecto iOS de CocoaPods a Swift Package Manager, simplificando la gestión y reduciendo errores de integración.",
            "sync-process-title": "Procesos de sincronización de información con el servidor",
            "sync-process": "Se desarrollaron mecanismos de sincronización para asegurar que la app funcione correctamente incluso sin conexión, actualizando datos al recuperar la red."
        },
        "shopping-expenses-android": {
            "title-subscription": "Implementación de suscripciones.",
            "detail-subscription": "Se implementó la librería Google Play Billing para habilitar la compra de suscripciones mensuales y anuales por parte de los usuarios.",
            "title-profile-user": "Creación de sección de perfil.",
            "detail-profile-user": "Se desarrolló una sección destinada a la gestión del perfil del usuario y la visualización de los detalles de sus suscripciones.",
            "title-mangment-group": "Sección de gestión de usuarios.",
            "detail-mangment-group": "Se creó una sección que permite la administración de usuarios por proyecto, facilitando la gestión multiusuario y el intercambio de información entre ellos.",
            "title-connect-backend": "Conexión de aplicación con backend.",
            "description-connect-backend": "Se estableció la sincronización de la información local con la base de datos del servidor, lo que permitió a los usuarios acceder a sus datos de forma asincrónica desde múltiples dispositivos.",
            "title-change-model-room": "Migración a Room Database.",
            "detail-change-model-room": "Se realizó la migración desde un sistema basado en Cursor a Room Database, implementando los ajustes necesarios para habilitar la sincronización entre dispositivos.",
            "title-change-model-backups": "Migración del modelo de respaldos (locales y en línea).",
            "detail-change-model-backups": "Se mejoró el mecanismo de creación y manejo de respaldos tanto locales como en la nube, proporcionando mayor seguridad y facilidad de uso para los usuarios.",
            "title-backup-system": "Sistema de respaldos en formato JSON.",
            "detail-backend-system": "Se implementó un sistema automático de respaldos en formato JSON, permitiendo la recuperación de datos ante fallos o pérdida de información.",
            "title-migration-backend": "Migración del modelo de peticiones en Android.",
            "description-migration-backend": "Se llevó a cabo la migración al nuevo modelo de backend, como parte de la segunda versión del sistema y la adopción de NestJS, lo cual incrementó la eficiencia en la sincronización de datos.",
            "title-update-gradle": "Actualización de librerías en Gradle.",
            "detail-update-gradle": "Se actualizaron las versiones de las librerías utilizadas en el proyecto, gestionadas mediante Gradle, para asegurar mejoras de compatibilidad y rendimiento.",
            "title-managment-information": "Optimización del procesamiento de información.",
            "detail-managment-information": "Se realizaron mejoras significativas en el procesamiento de datos, reduciendo hasta en un 40% el tiempo de espera de los usuarios al interactuar con la aplicación.",
            "title-local-sync": "Gestión de almacenamiento local.",
            "detail-local-sync": "Se adoptó un nuevo modelo para el almacenamiento local y la sincronización con servicios REST, lo cual mejoró la organización del código, el rendimiento en el manejo de datos y permitió la operación sin conexión.",
            "title-library-graph": "Librería para visualización de gráficos.",
            "detail-library-graph": "Se integró una librería especializada para la representación gráfica de la información del usuario, facilitando la interpretación visual de los datos presentados."
        },
        "shopping-expense-web": {
            "new-web-title": "Creación de nueva versión web.",
            "new-web": "Se desarrolló una nueva versión de la aplicación web, modernizando su estructura, haciendo su mantenimiento mas sencillo, estableciendo clean code y buenas practicas.",
            "title-create-model-sync": "Diseño del modelo de sincronización inicial y actual.",
            "detail-create-model-sync": "Se llevó a cabo la planificación y el análisis del modelo de sincronización entre dispositivos móviles, plataforma web, backend y base de datos, permitiendo la transmisión de información en tiempo real, así como el funcionamiento sin conexión y la sincronización de datos desde múltiples fuentes.",
            "new-backend-title": "Creación de nuevo backend y ejecución en el servidor.",
            "new-backend": "Se desarrolló un nuevo backend desde cero y se implementó en el servidor, brindando una base sólida y escalable para el funcionamiento de la aplicación.",
            "implementation-frameworks-title": "Implementación de Angular Material en componentes.",
            "implementation-frameworks": "Se integraro el framework de Angular Material, en algunas de estas tablas con paginación, mejorando la experiencia de usuario y diseño mas amigable.",
            "migration-request-title": "Conexión de la request con el nuevo backend.",
            "migration-request": "Se adaptó la lógica de comunicación entre backend web y movil, asegurando la integridad de los datos y el correcto funcionamiento del sistema.",
            "deploy-version-title": "Despliegue de la nueva versión en el servidor.",
            "deploy-version": "Se realizó la puesta en producción del nuevo sistema web, asegurando su disponibilidad para los usuarios y supervisando su correcto funcionamiento."
        },
        "console-encodemx-web": {
            "admin-user-title": "Funciones para administrar usuarios de la aplicación.",
            "admin-user": "Se desarrollaron funciones clave de gestión de usuarios, incluyendo validación de suscripciones, verificación de compras, recuperación de contraseñas, restauración de cuentas eliminadas y modificación de suscripciones activas.",
            "admin-database-title": "Funciones administrativas de base de datos.",
            "admin-database": "Se implementaron herramientas para operaciones avanzadas como la copia completa de información entre bases de datos y la exportación total de los datos de un usuario específico.",
            "new-backend-title": "Creación de un nuevo backend más moderno",
            "new-backend": "Se desarrolló un backend completamente nuevo con tecnologías actuales, mejorando la arquitectura general, la seguridad y el rendimiento del sistema.",
            "cron-job-title": "Trabajos cronometrados para validar compras de usuarios cada cierto tiempo",
            "cron-job": "Se implementaron tareas automatizadas (cron jobs) para validar periódicamente las compras de los usuarios, garantizando la vigencia de los accesos y servicios."
        },
        "productivity-web": {
            "proyect-requirements-title": "Levantamiento de requerimientos generales del proyecto.",
            "proyect-requirements": "Se realizó un análisis detallado para definir los requerimientos funcionales y no funcionales del sistema, alineando las necesidades del cliente con los objetivos técnicos del proyecto.",
            "database-title": "Creación de la base de datos y análisis de requerimientos técnicos.",
            "database": "Se diseñó e implementó la estructura de base de datos a partir del análisis de los flujos de información y relaciones entre entidades.",
            "interfaz-desing-title": "Creación de interfaz y diseño.",
            "interfaz-desing": "Se desarrolló la interfaz de usuario con enfoque en experiencia, usabilidad y adaptación visual para distintos dispositivos.",
            "backend-title": "Creación del backend y despliegue.",
            "backend": "Se construyó el backend para gestionar la lógica, el manejo de datos y la seguridad, y se desplegó en el servidor correspondiente.",
            "deploy-web-title": "Despliegue de la versión web.",
            "deploy-web": "Se publicó la aplicación web en el entorno de producción, garantizando su disponibilidad para los usuarios finales.",
            "request-backend-title": "Realizar solicitudes con el backend.",
            "request-backend": "Se conectó la interfaz con el backend, permitiendo la transmisión y recepción de datos entre cliente y servidor de forma fluida y segura."
        },
        "daily-expenses-4-web": {
            "clean-code-title": "Reestructuración de código y correcciones.",
            "clean-code": "Se realizó una reorganización profunda del código para mejorar la legibilidad, mantenimiento y rendimiento, corrigiendo errores detectados.",
            "migration-request-title": "Migración de requests a un nuevo API",
            "migration-request": "Se adaptaron las solicitudes del sistema para consumir un nuevo API, asegurando compatibilidad y mejor rendimiento.",
            "imlements-web-socket-title": "Migración del sistema de requests a WebSocket.",
            "imlements-web-socket": "Se implementó la comunicación mediante WebSocket para optimizar la interacción en tiempo real entre cliente y servidor.",
            "multi-currency-title": "Función de multimoneda con cálculos.",
            "multi-currency": "Se desarrolló una función que permite manejar múltiples monedas, realizando conversiones y cálculos automáticos dentro del sistema.",
            "support-title": "Corrección de reportes de errores de usuarios y soporte.",
            "support": "Se atendieron y resolvieron errores reportados por usuarios, mejorando la estabilidad y usabilidad del sistema.",
            "custom-components-title": "Creación de nuevos componentes personalizados con nuevas funciones.",
            "custom-components": "Se diseñaron e implementaron componentes personalizados que incorporan funcionalidades específicas, adaptadas a las necesidades del proyecto."
        },
        "samuel-daily-expenses-4-android": {
            "title-desing": "Diseño en XML para vistas de Android",
            "detail-desing": "Se crearon los diseños y colecciones necesarias para el funcionamiento de la aplicación.",
            "title-room": "Modelo con Room Database",
            "detail-room": "Se creó el modelo y esquema de base de datos utilizando Room para la persistencia local.",
            "title-sync": "Modelo de sincronización – versiones v1, v2 y v3",
            "detail-sync": "Se diseñó y desarrolló el modelo de sincronización para las versiones v1, v2 y v3 del backend, comenzando desde cero hasta una versión escalable, optimizada para manejar grandes volúmenes de datos.",
            "title-managment-reports": "Manejo de reportes",
            "detail-managment-reports": "Se desarrollaron clases para la gestión de diferentes tipos de reportes en la aplicación, considerando las diversas pantallas y su funcionalidad particular.",
            "title-subscription": "Implementación de suscripciones",
            "detail-subscription": "Se integró Google Play Billing para habilitar la compra de suscripciones mensuales y anuales por parte de los usuarios.",
            "title-mangment-multi-account": "Gestión de múltiples cuentas",
            "detail-mangment-multi-account": "Se implementó la funcionalidad para manejar múltiples cuentas dentro de la aplicación, permitiendo su administración y comparación.",
            "title-mangment-photo": "Manejo de imágenes",
            "detail-mangment-photo": "Se añadió lógica para la carga y sincronización de imágenes proporcionadas por los usuarios, tanto de forma individual como sincronizada."
        },
        "samuel-daily-expenses-4-web": {
            "title-database": "Modelo y gestión de base de datos",
            "detail-database": "Se realizó un análisis y diseño para la creación, mantenimiento y modificación de la base de datos del proyecto.",
            "title-backend": "Desarrollo de backend (versiones 1 a 3)",
            "detail-backend": "En conjunto con el equipo de desarrollo, se creó el backend en PHP con funcionalidades CRUD para las versiones web y móvil, incluyendo mejoras en el modelo de sincronización.",
            "title-frequent-operations": "Registros frecuentes en línea",
            "detail-frequent-operations": "Se desarrolló un modelo interno en el backend para la gestión y creación de registros frecuentes de forma automática.",
            "title-purchased-php": "Gestión de suscripciones con Google Play Billing (PHP)",
            "detail-purchased-php": "Se implementó la renovación de suscripciones mediante sockets, utilizando Google Play Billing y lenguaje PHP para la extensión automática del tiempo.",
            "title-purchased-nestjs": "Gestión de suscripciones con Google Play Billing (NestJS)",
            "detail-purchased-nestjs": "Se replicó la funcionalidad de renovación de suscripciones con sockets, utilizando el framework NestJS para el backend.",
            "title-bugs": "Corrección de versión productiva",
            "detail-bugs": "Se corrigieron errores reportados por usuarios en la versión inicial en producción.",
            "title-improvements": "Mejoras visuales y responsivas",
            "detail-improvements": "Se implementaron mejoras solicitadas por el diseñador en varios componentes de la interfaz web.",
            "title-sync": "Sincronización entre backend y frontend",
            "detail-sync": "Se realizaron mejoras en la lógica de carga y sincronización de datos entre el backend y la interfaz web.",
            "title-responsive": "Diseño responsivo",
            "detail-responsive": "Se adaptó el diseño para un uso óptimo en tablets y dispositivos móviles."
        },
        "samuel-console-encodemx-web": {
            "title-migracion-respaldos": "Incorporación de migración de respaldos",
            "detail-migracion-respaldos": "Se implementó la migración de respaldos para asegurar la integridad y disponibilidad de la información.",
            "title-manejo-compras-v3": "Manejo y visualización de compras versión 3",
            "detail-manejo-compras-v3": "Se gestionaron las compras y se habilitó la visualización de información de compras en la versión 3.",
            "title-migracion-datos-qa": "Migración de datos a base de datos QA",
            "detail-migracion-datos-qa": "Se migraron los datos de la versión productiva a la base de datos QA para gastos diarios 4.",
            "title-crud-usuarios": "Implementación de CRUD para usuarios",
            "detail-crud-usuarios": "Se desarrolló la funcionalidad CRUD para la gestión de usuarios, incluyendo la administración y actualización de la información de compras."
        },
        "samuel-zeus": {
            "title-modulo-swat": "Integración del módulo SWAT para atención al cliente en Mesa de Ayuda",
            "detail-modulo-swat": "Se incorporó el módulo SWAT a la aplicación para gestionar solicitudes de atención al cliente desde la Mesa de Ayuda.",
            "title-correccion-bugs": "Corrección de errores visuales y funcionales",
            "detail-correccion-bugs": "Se solucionaron problemas de diseño e inconsistencias funcionales para mejorar la experiencia del usuario.",
            "title-busqueda-bes": "Búsqueda de tickets en plataforma BES",
            "detail-busqueda-bes": "Se implementó una funcionalidad que permite consultar tickets fuera del entorno de Zeus mediante integración con la plataforma BES.",
            "title-diseno-responsivo": "Diseño responsivo funcional",
            "detail-diseno-responsivo": "Se adaptó la interfaz para garantizar una experiencia óptima en distintos dispositivos y tamaños de pantalla.",
            "title-crud-servicios": "Implementación de CRUD para servicios",
            "detail-crud-servicios": "Se desarrolló un módulo CRUD para gestionar los servicios disponibles dentro del aplicativo.",
            "title-mejoras-usuarios": "Mejoras en la gestión de usuarios",
            "detail-mejoras-usuarios": "Se optimizó el proceso de creación, edición y mantenimiento de usuarios para facilitar su administración."
        },
        "samuel-blue-board": {
            "title-video-library": "Implementación de librería para reproducción de videos",
            "detail-video-library": "Se integró una librería para permitir la reproducción de contenido multimedia dentro de la aplicación.",
            "title-preferences-filters": "Gestión de filtros mediante preferencias",
            "detail-preferences-filters": "Se implementaron filtros personalizados utilizando el sistema de preferencias del usuario.",
            "title-java-gradle-update": "Actualización de versión de Java y Gradle",
            "detail-java-gradle-update": "Se actualizó la versión de Java y se migró a una versión más reciente de Gradle para mantener la compatibilidad y seguridad del proyecto.",
            "title-vulnerability-fix": "Corrección de vulnerabilidades detectadas por Checkmarks",
            "detail-vulnerability-fix": "Se corrigieron vulnerabilidades críticas y advertencias señaladas por el análisis estático de Checkmarks para reforzar la seguridad del sistema."
        },
        "samuel-sisap": {
            "title-visual-fixes": "Correcciones o mejoras visuales",
            "detail-visual-fixes": "Se realizaron ajustes para optimizar la apariencia y usabilidad del sistema, mejorando la experiencia del usuario.",
            "title-preferences-filters": "Preferences filtros",
            "detail-preferences-filters": "Se implementaron y optimizaron filtros personalizados en la sección de Preferencias para facilitar la búsqueda y selección de opciones.",
            "title-java-gradle-update": "Cambio de versión de Java y actualización de Gradle",
            "detail-java-gradle-update": "Se actualizó la versión de Java y se migró a una versión más reciente de Gradle para asegurar compatibilidad, estabilidad y mejor rendimiento.",
            "title-vulnerability-fix": "Corrección de vulnerabilidades checkmarks",
            "detail-vulnerability-fix": "Se corrigieron vulnerabilidades detectadas por Checkmarks, reforzando la seguridad y la integridad del sistema.",
            "title-backend-new-services": "Incorporación de nuevos servicios en backend",
            "detail-backend-new-services": "Se añadieron nuevos servicios para manejo de estado de folio, cancelación, detener folio, relocate, rechazar y resumen de folio."
        },
        "price-list-movil": {
            "title-code-reestructure" : "Reconstruccion de codigo",
            "detail-code-reestructure" : "Se modificaron clases para organizar de una manera mas eficiente la muestra de datos, mejorando lso tiempos",
            "title-creation-preferences" : "Creacion de nuevas preferencias",
            "detail-creation-preferences" : "Se crearon nuevas shared preferences para saber las listas de precios a usar por el usuario",
            "title-delete-trashcode" : "Borrar codigo basura",
            "detail-delete-trashcode" : "Se borró codigo basura de distintas clases, como consultas innecesarias, codigo comentado, funciones sin usar, etc."
        }
    },
    "random-text": {
        "knowmore": "Conoce mas"
    },
    "ap-app-info": {
        "screen1-title": "Inicio",
        "screen1-text1": "En esta pantalla podras escribir tu usuario y contraseña",
        "screen1-text2": "En caso de no tener un correo registrado, podra crear cuenta",
        "screen1-text3": "Sino no te apetece crear cuenta podras iniciar con Google",
        "screen1-text4": "Puedes recuperar tu contraseña en caso de haberla olvidado",
        "screen2-title": "Pantalal principal",
        "screen2-text1": "Esta es la pantalla principal ",
        "screen2-text2": "La información de tus tablero se mostrara nada mas entrar a la app",
        "screen2-text3": "Al final puedes ver el top 3 de las categorias que mas usas",
        "screen2-text4": "Del lado izquierdo tienes todas las secciones",
        "screen3-title": "Añadir Estados",
        "screen3-text1": "Solo ocupas escribir el nombre de tu estado, seleccionar tus colores y cuando termines confirmar el estado ",
        "screen3-text2": "Una vez agregado el estado aparecera en la lista",
        "screen3-text3": "Podras ver un ejemplo de como se ve tu estado ",
        "screen4-title": "Tablero Añadido",
        "screen4-text1": " Asi se ve cuando añades un tablero ",
        "screen4-text2": "En la carta puedes apreciar el nombre y el detalle previamente añadido ",
        "screen4-text3": "Puedes agregar cuantos quieras.",
        "screen5-title": "Categorias",
        "screen5-text1": "Puedes apreciar ts categorias en forma de lista ",
        "screen5-text2": "Puedes agregar mas categorias ",
        "screen5-text3": "Editarlas si asi lo deseas",
        "screen6-title": "Categoria añadida",
        "screen6-text1": "Para añadir una categoria, solo basta con pulsar el boton de agregar para que te deje escribir el nombre de tu categoria",
        "screen6-text2": "Una vez agregada aparecera en la lista",
        "screen6-text3": "Puedes ordenar tuscategorias por orden alfabetico o eliminarlas",
        "screen6-text4": "Tambien pudes buscar entre tus categorias",
        "screen7-title": "Estados",
        "screen7-text1": "Estos son los estados que tienes, ordenados en forma de lista ",
        "screen7-text2": "Puedes agregar mas estados si lo deseas",
        "screen7-text3": "Ordenar tus estados por orden alfabetico tambien es posible o buscar entre ellos",
        "screen8-title": "Añadir Estados",
        "screen8-text1": "Solo ocupas escribir el nombre de tu estado, seleccionar tus colores y cuando termines confirmar el estado ",
        "screen8-text2": "Una vez agregado el estado aparecera en la lista",
        "screen8-text3": "Podras ver un ejemplo de como se ve tu estado ",
        "screen9-title": "Añadir Estados",
        "screen9-text1": "Estos son tus datos de usuario ",
        "screen9-text2": "Puedes cambiarlos en cualquier momento que quieras ",
        "screen9-text3": "Puedes seleccionar los colores de preferencia"
    }
}