{
    "app-name" : "Salwort Devs",
    "page" : {
        "home" : "Inicio",
        "devs" : "Desarrolladores",
        "apps" : "Aplicaciones",
        "about" : "Acerca de"
    },
    "policy_privaticy" : {
        "title" : "Politicas de privacidad",
        "description" : "En Salwort Devs, nos comprometemos a proteger y respetar su privacidad. Esta política de privacidad explica cómo recopilamos, usamos, divulgamos y protegemos su información personal cuando visita nuestro sitio web y utiliza nuestros servicios.",
        "title-point-1" : "Información que recopilamos",
        "description-point-1" : "Podemos recopilar y procesar los siguientes datos personales: Información que usted nos proporciona: Nombre, dirección de correo electrónico, número de teléfono y cualquier otra información que nos envíe a través de formularios en nuestro sitio web. Información que recopilamos automáticamente: Información sobre su visita, incluidos los datos de tráfico, los datos de ubicación, los weblogs y otros datos de comunicación, así como los recursos a los que accede. Cookies y tecnologías similares: Utilizamos cookies para recopilar información sobre su actividad en línea en nuestro sitio web. Puede controlar el uso de cookies a través de la configuración de su navegador.",
        "title-point-2" : "Uso de su información",
        "description-point-2" : "Utilizamos la información que recopilamos para los siguientes fines:\n\nProporcionar y gestionar nuestros servicios.\nPersonalizar su experiencia en nuestro sitio web.\n\nComunicarnos con usted, incluyendo el envío de notificaciones y actualizaciones importantes.\n\nMejorar nuestro sitio web y servicios mediante el análisis de cómo los usuarios interactúan con ellos.\nCumplir con nuestras obligaciones legales y resolver disputas.",
        "title-point-3" : "Divulgación de su información",
        "description-point-3" : "Podemos compartir su información personal con terceros en las siguientes circunstancias:\n\nCon proveedores de servicios que nos ayudan a operar nuestro negocio, como servicios de alojamiento web y análisis de datos.\n\nSi estamos obligados a divulgar su información para cumplir con una obligación legal o para proteger nuestros derechos, propiedad o seguridad.\n\nEn caso de una fusión, adquisición o venta de activos, sus datos pueden ser transferidos como parte de la transacción.",
        "title-point-4" : "Seguridad de su información", 
        "description-point-4" : "Tomamos medidas razonables para proteger su información personal contra el acceso no autorizado, la alteración, la divulgación o la destrucción.\n\nSin embargo, ninguna transmisión de datos a través de Internet o almacenamiento electrónico es completamente segura.\n\nPor lo tanto, no podemos garantizar la seguridad absoluta de su información.",
        "title-point-5" : "Retencion de información", 
        "description-point-5" : "Retenemos su información personal solo durante el tiempo necesario para cumplir con los fines para los que fue recopilada, incluidos los requisitos legales, contables o de informes.",
        "title-point-6" : "Sus derechos", 
        "description-point-6" : "Tiene derecho a acceder, corregir, actualizar o eliminar su información personal. También puede tener derecho a restringir o oponerse al procesamiento de su información personal, así como a solicitar la portabilidad de sus datos. Para ejercer estos derechos, comuníquese con nosotros a través de los detalles de contacto proporcionados a continuación.",
        "title-point-7" : "Cambios a esta política de privacidad", 
        "description-point-7" : "Podemos actualizar esta política de privacidad de vez en cuando. Publicaremos cualquier cambio en esta página y, si los cambios son significativos, le notificaremos por correo electrónico o mediante un aviso en nuestro sitio web."

    },
    "home" : {
        "home-description" : "En Salwort somos una empresa joven e innovadora. Comprometidos con la investigación, optimización y sistematizar soluciones.",
        "title-1" : "Pantalla Principal",
        "screen-1" : " En esta pantalla tu puedes registrarte en caso de tu tener una cuenta ya, crear una o ingresar con Google ",
        "title-2" : "Pagina de inicio",
        "screen-2" : "Podras observar varias secciones, los tabaleros que tienes, sus estados y abajo un top de categorias, para que puedas ver las categorias que mas has usado",
        "title-3" : "Tableros",
        "screen-3" : "Aqui puedes agregar un  tablero junto con su detalle",
        "title-4" : "Tablero guardado",
        "screen-4" : "Aqui ya puedes apreciar como se guardó el tablero",
        "title-5" : "Categorias",
        "screen-5" : " En esta pantalla puedes agregar tus categorias",
        "title-6" : " Como agregar categorias",
        "screen-6" : "Basta con darle al boton de mas para poder agregar una categoria, posteriormente solo debes pulsar la confirmación",
        "title-7" : "Estados",
        "screen-7" : "Puedes visualizar un listado de tus estados, asi como un ejemplo de como se ven.",
        "title-8" : "Como agregar estados",
        "screen-8" : "Es tan simple como pulsar el boton de agregar, colocarle un nombre a tu estado asi como sus colores, y luego confirmar",
        "title-9" : "Perfil de usuario",
        "screen-9" : "Tus datos de usuario, puedes actualizar tu nombre correo y contraseña"
    },
    "apps-features" : {
        "properties" : {
            "name-1-activityp" : "Administra tu tiempo",
            "detail-1-activityp" : "Podras administrar mejor tu tiempo, no se te olvidar cosas",
            "name-2-activityp" : "Planifica tus actividades",
            "detail-2-activityp" : "El planificar tus actividades aprovecha tu tiempo al maximo",
            "name-3-activityp" : "Aprovecha tu tiempo",
            "detail-3-activityp" : "Aprovechar tu tiempo te servira para poder tener bien medido tus tiempos",
            "name-1-cooking" : "Muchos tipos de comida ",
            "detail-1-cooking" : "En esta aplicacion vas a poder descubrir una cantidad inimaginable de recetas que te encantaran",
            "name-2-cooking" : "Socializa mediante recetas",
            "detail-2-cooking" : "Vas a poder dejar retroalimentacion a las recetas, de esa manera haciendole saber a todos la calidad de la receta" 
        }
    },
    "footer" :  {
        "description" : "Bienvenido a Saltwort Devs. Nos comprometemos a proteger y respetar su privacidad. Los datos proporcionados por los usuarios o contactos son altamente resguardados por nuestras politicas de privacidad rigorosas. Para conocer nuestras politicas de privacidad,",
        "contact-us" : "Contactanos"
    },
    "about-of" : {
      "mision" : " Misión",
      "vision"  : " Visión",
      "objectives" : " Objectivos",
      "mision-desc" : " Nuestro compromiso es desarrollar propuestas que impulsen el crecimiento y la eficiencia de nuestros clientes, proporcionando soluciones adaptadas a un entorno en constante evolución, con el objetivo de construir un futuro más sostenible y competitivo.",
      "vision-desc" : "  Ser reconocidos como líderes en innovación y desarrollo de soluciones tecnológicas que transformen la forma en que las empresas operan y se adaptan a un mundo en constante cambio. Aspiramos a establecer nuevos estándares de eficiencia y sostenibilidad en cada sector en el que participamos, convirtiéndonos en el socio preferido para organizaciones que buscan no solo crecer, sino también evolucionar con agilidad y resiliencia. En Saltwort, visualizamos un futuro donde nuestras soluciones no solo resuelven problemas actuales, sino que también anticipan las necesidades futuras, creando un impacto duradero y positivo en la sociedad y el medio ambiente.",
      "objectives-desc" : " En Saltwort nos enfocamos en desarrollar tecnologías innovadoras que optimicen la eficiencia operativa de nuestros clientes, permitiéndoles adaptarse con agilidad a los cambios del mercado. Nos comprometemos a la investigación continua, la creación de soluciones sostenibles y la expansión estratégica en mercados globales, mientras priorizamos la satisfacción del cliente mediante la entrega de soluciones personalizadas y de alta calidad."
    },
    "Devs" : {
        "Luis-desc" : "Soy un desarrollador junior con experiencia en varias tecnologías, incluyendo el uso de Android Studio con Kotlin y Visual Studio con C#. Tengo habilidades en la gestión de bases de datos, trabajando con PostgreSQL, MySQL y Management. Me considero una persona con gran disposición para aprender y crecer en el campo del desarrollo",
        "Samuel-desc" : "Con más de 5 años de experiencia en diversas áreas, cuento con sólidos conocimientos en el desarrollo de aplicaciones Android usando Java, Kotlin y XML. En el ámbito web, manejo tecnologías como JavaScript, HTML, CSS, Angular y TypeScript para crear soluciones interactivas y eficientes. Además, tengo experiencia en el backend con Node.js, PHP y NestJS, y en la gestión de servicios AWS, incluyendo EC2, S3 y otros",
        "Aksel-desc" : "Con experiencia en el desarrollo nativo para iOS utilizando Swift y en la creación de aplicaciones web con Angular, también cuento con habilidades en la elaboración de APIs REST con NestJS en entornos Node.js. Mi experiencia abarca la integración de servicios externos, la migración de tecnologías y la optimización de sistemas para mejorar el rendimiento y la escalabilidad"
    },
    "Devs-big-desc" : {
        "properties" :  {
            "Luis-desc" : "Soy un desarrollador junior con experiencia en diversas tecnologías, destacando mi habilidad en Android Studio con Kotlin para el desarrollo de aplicaciones móviles, donde he creado interfaces de usuario intuitivas e integrado características avanzadas. También tengo experiencia en Visual Studio con C#, desarrollando aplicaciones de escritorio y servicios eficientes. Mi competencia se extiende a la gestión de bases de datos, con conocimientos en PostgreSQL, MySQL y herramientas de administración. Me considero una persona altamente motivada y dispuesta a aprender, con un enfoque constante en mejorar mis habilidades y crecer en el campo del desarrollo",
            "Samuel-desc" : "Desarrollador con más de 5 años de experiencia en desarrollo web y backend, y experto en Android Studio con Java y Kotlin. En el desarrollo móvil, he utilizado Android Studio para crear aplicaciones robustas, optimizando el rendimiento y la experiencia del usuario con Java y Kotlin. Tengo experiencia en el diseño de interfaces con XML, la integración de APIs, y la implementación de arquitecturas como MVVM. En el ámbito web, soy competente en tecnologías frontend como JavaScript, HTML, CSS y Angular, con un enfoque en la creación de interfaces responsivas. En el backend, tengo amplios conocimientos en Node.js, PHP y NestJS, con experiencia en la generación de archivos XLSX y CSV. Además, manejo servicios en la nube de AWS, incluyendo EC2, S3 y ELB, con experiencia en el despliegue de aplicaciones en subdominios de EC2 y la administración de contenedores S3. He utilizado PM2 para despliegues en AWS y he implementado validaciones de compras a través de APIs de Google en proyectos backend. Mi experiencia también incluye el uso de Bootstrap para diseño CSS y el despliegue de aplicaciones en entornos de producción de alta disponibilidad",
            "Aksel-desc" : "Soy un programador con amplia experiencia en el desarrollo de aplicaciones móviles para iOS utilizando Swift, creando soluciones eficientes y bien diseñadas para la plataforma Apple. En el desarrollo web, manejo con soltura Angular para construir interfaces de usuario dinámicas y responsivas que se adaptan a diferentes dispositivos. Tengo un sólido conocimiento en la creación de APIs REST con NestJS en entornos Node.js, facilitando una comunicación segura y eficiente entre sistemas. Mi experiencia incluye la integración de servicios externos, la migración de tecnologías para asegurar transiciones suaves y sin interrupciones, y la optimización de sistemas para mejorar el rendimiento y la escalabilidad, adaptándome a las crecientes demandas del mercado",
            "related-projects" : "Proyectos relacionados"
        }
    },
    "specific-project": {
        "properties" : {
            "project-detail-ventaplus-luis" : "Punto de venta",
            "revelant-skills-1-ventaplus-luis" : "Actualizacion de versiones",
            "revelant-skills-2-ventaplus-luis" : "Cambio de la version 24 a la version 33",
            "project-detail-crm-luis" :"CRM para clientes ",
            "revelant-skills-1-crm-luis" : "Consultas base de datos",
            "revelant-skills-2-crm-luis" : "Creacion PDF y exportacion Excel",
            "revelant-skills-3-crm-luis" : "Arquitectura MVC",
            "project-detail-cvm-luis" : "Proyecto interno",
            "revelant-skills-cvm-1-luis" : "Inyección de dependencias",
            "revelant-skills-cvm-2-luis" : "Retrofit",
            "revelant-skills-cvm-3-luis" : "Arquitectura MVVM",
            "project-detail-encode-aksel" : "Capturador de ingreso en proyecto",
            "revelant-skills-encode-aksel" : "Cambio de cocoa pods",
            "desc-general" : "Dentro de este proyecto implemente el puesto como desarrollador android, de las funciones relevantes dentro de esta aplicacion son: ",
            "project-detail-shopping-expense-samuel" :"Proyecto de funcionalidad o herramienta diseñada para registrar, de manera sistemática y organizada, toda la información relevante sobre la entrada de datos en un proyecto. Permite gestionar y almacenar detalles específicos de cada ingreso, asegurando precisión y trazabilidad. Este sistema facilita la administración y el seguimiento de los datos ingresados, optimizando el flujo de trabajo y brindando soporte en la toma de decisiones al permitir una visión clara y actualizada del progreso en el proyecto.",
            "revelant-skills-shopping-expenses-samuel" : "Creacion de proyecto",
            "project-detail-daily-expenses-samuel"  :"Capturador de ingreso en proyecto",
            "revelant-skills-daily-expenses-samuel" : "Creacion de proyecto"
        }
    },
    "random-text" : {
        "knowmore" : "Conoce mas"
    },
    "ap-app-info" : {
        "screen1-title" : "Inicio",
        "screen1-text1" : "En esta pantalla podras escribir tu usuario y contraseña",
        "screen1-text2" : "En caso de no tener un correo registrado, podra crear cuenta",
        "screen1-text3" : "Sino no te apetece crear cuenta podras iniciar con Google",
        "screen1-text4" : "Puedes recuperar tu contraseña en caso de haberla olvidado",
        "screen2-title" : "Pantalal principal",  
        "screen2-text1" : "Esta es la pantalla principal ",
        "screen2-text2" : "La información de tus tablero se mostrara nada mas entrar a la app",
        "screen2-text3" : "Al final puedes ver el top 3 de las categorias que mas usas",
        "screen2-text4" : "Del lado izquierdo tienes todas las secciones",
        "screen3-title" : "Añadir Estados",  
        "screen3-text1" : "Solo ocupas escribir el nombre de tu estado, seleccionar tus colores y cuando termines confirmar el estado ",
        "screen3-text2" : "Una vez agregado el estado aparecera en la lista",
        "screen3-text3" : "Podras ver un ejemplo de como se ve tu estado ",
        "screen4-title" : "Tablero Añadido",  
        "screen4-text1" : " Asi se ve cuando añades un tablero ",
        "screen4-text2" : "En la carta puedes apreciar el nombre y el detalle previamente añadido ",
        "screen4-text3" : "Puedes agregar cuantos quieras.",
        "screen5-title" : "Categorias",  
        "screen5-text1" : "Puedes apreciar ts categorias en forma de lista ",
        "screen5-text2" : "Puedes agregar mas categorias ",
        "screen5-text3" : "Editarlas si asi lo deseas",
        "screen6-title" : "Categoria añadida",  
        "screen6-text1" : "Para añadir una categoria, solo basta con pulsar el boton de agregar para que te deje escribir el nombre de tu categoria",
        "screen6-text2" : "Una vez agregada aparecera en la lista",
        "screen6-text3" : "Puedes ordenar tuscategorias por orden alfabetico o eliminarlas",
        "screen6-text4" : "Tambien pudes buscar entre tus categorias",
        "screen7-title" : "Estados",  
        "screen7-text1" : "Estos son los estados que tienes, ordenados en forma de lista ",
        "screen7-text2" : "Puedes agregar mas estados si lo deseas",
        "screen7-text3" : "Ordenar tus estados por orden alfabetico tambien es posible o buscar entre ellos",
        "screen8-title" : "Añadir Estados",  
        "screen8-text1" : "Solo ocupas escribir el nombre de tu estado, seleccionar tus colores y cuando termines confirmar el estado ",
        "screen8-text2" : "Una vez agregado el estado aparecera en la lista",
        "screen8-text3" : "Podras ver un ejemplo de como se ve tu estado ",
        "screen9-title" : "Añadir Estados",  
        "screen9-text1" : "Estos son tus datos de usuario ",
        "screen9-text2" : "Puedes cambiarlos en cualquier momento que quieras ",
        "screen9-text3" : "Puedes seleccionar los colores de preferencia"
    }
}